#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.main.data.archive_file.lambda_zip: Reading...
module.main.data.archive_file.lambda_zip: Read complete after 0s [id=8e02b4cae57376ab599f40fd2ce20b07b0e0b468]
module.main.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/lapwing-item-news-dev-lambda]
module.main.aws_ssm_parameter.twitter_api_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiSecret]
module.main.aws_iam_role.lambda_role: Refreshing state... [id=lapwing-item-news-dev-lambda-role]
module.main.aws_iam_role.scheduler_role: Refreshing state... [id=lapwing-item-news-dev-scheduler-role]
module.main.aws_ssm_parameter.twitter_api_key: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiKey]
module.main.aws_s3_bucket.bucket: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_ssm_parameter.twitter_access_token: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessToken]
module.main.aws_scheduler_schedule_group.group: Refreshing state... [id=lapwing-item-news-dev-scheduler-group]
module.main.aws_ssm_parameter.twitter_access_token_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessTokenSecret]
module.main.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy]
module.main.aws_lambda_function.lambda_function: Refreshing state... [id=lapwing-item-news-dev-lambda]
module.main.aws_iam_role_policy_attachment.lambda: Refreshing state... [id=lapwing-item-news-dev-lambda-role/arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy]
module.main.aws_iam_policy.scheduler_policy: Refreshing state... [id=arn:aws:iam::087164360110:policy/lapwing-item-news-dev-scheduler-policy]
module.main.aws_scheduler_schedule.invoke_lambda: Refreshing state... [id=lapwing-item-news-dev-scheduler-group/lapwing-item-news-dev-scheduler]
module.main.aws_iam_role_policy_attachment.scheduler: Refreshing state... [id=lapwing-item-news-dev-scheduler-role/arn:aws:iam::087164360110:policy/lapwing-item-news-dev-scheduler-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.main.aws_cloudwatch_log_group.lambda_log_group is tainted, so must be replaced
-/+ resource "aws_cloudwatch_log_group" "lambda_log_group" {
      ~ arn               = "arn:aws:logs:ap-northeast-1:087164360110:log-group:/aws/lambda/lapwing-item-news-dev-lambda" -> (known after apply)
      ~ id                = "/aws/lambda/lapwing-item-news-dev-lambda" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
        name              = "/aws/lambda/lapwing-item-news-dev-lambda"
      + name_prefix       = (known after apply)
      ~ retention_in_days = 0 -> 14
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.main.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "lapwing-item-news-dev-lambda"
      ~ last_modified                  = "2025-10-04T15:09:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "AlrHR1nK7AhvDS54rpBKtjKyUFozy6mVRaQeEyxPQpQ=" -> "I6MrKNBis/xuwWokQJ3oEvse/7h771zHOjeq6Kn53t4="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.main.aws_scheduler_schedule.invoke_lambda will be updated in-place
  ~ resource "aws_scheduler_schedule" "invoke_lambda" {
        id                           = "lapwing-item-news-dev-scheduler-group/lapwing-item-news-dev-scheduler"
        name                         = "lapwing-item-news-dev-scheduler"
      ~ state                        = "DISABLED" -> "ENABLED"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: `HiroM320`, Stage: `dev`*

If you want to deploy this, please comment the following text.
```
/deploy 18246340933
```